j
= е╟е╨е├е░╛Ё╩є

д│д│д╟д╧бвRacc дЄ╗╚д├д╞дддпдждид╟┴°╢°д╖д╜джд╩╠ф┬ъд╦д─ддд╞╜ёднд▐д╣бг

== ╡м┬зе╒ебедеыдме╤б╝е╣еиещб╝д╦д╩дыд

еиещб╝есе├е╗б╝е╕д╦╣╘╚╓╣цдЄ╝ид╣┐Ї╗·дм╜╨д╞дддыд╧д║д╟д╣бгд╜д╬╣╘дЄе╕е├д╚
╕лд╞╣═дид▐д╖дчджбге╓еэе├епдЄ╩─д╕ды╣╘д╟еиещб╝д╦д╩ды╛ь╣чд╧бвд╔д│длд╟
│лдн│ч╕╠ (д╩д╔) д└д▒дЄ┴¤дфд╖д╞д╖д▐д├д╞ддды▓─╟╜└ндм╣тддд╟д╣бг

== д╩дєд┐дщ conflict д├д╞╕└дядьд┐

░ь╚╓двдъдмд┴д╟░ь╚╓╠╠┼▌д╩╠ф┬ъд╧╛╫╞═ (conflict) д╟д╖дчджбг
╩╕╦б├цд╦╛╫╞═дмдвдыд╚бвracc д╧е│еєе╤едеы╕хд╦
б╓5 shift/reduce conflictб╫д╬дшджд╩есе├е╗б╝е╕дЄ╔╜╝ид╖д▐д╣бг
-v дЄд─д▒дыд╚╜╨╬╧д╡дьды .output е╒ебедеыдлдщд╧д╡дщд╦╛▄д╖дд╛Ё╩єдм╞└дщдьд▐д╣бг
д╜дьдЄд╔дж╗╚дждлбвд╚длд╜джддджд│д╚д╦┤╪д╖д╞д╧бвд╜дьд╩дъд╬╦▄дЄ╞╔дєд╟дпд└д╡ддбг
д╚д╞дтд│д│д╦╜ёд▒дыдшджд╩├▒╜уд╩╧├д╟д╧двдъд▐д╗дєбг
┼Ў┴│д╩дмдщб╪Ruby дЄ 256 ╟▄╗╚джд┐дсд╬╦▄ ╠╡╞╗╩╘б┘(└─╠┌╩Ў╧║├°)дмдк┤лдсд╟д╣бг

== е╤б╝е╡д╧╠ф┬ъд╩дп└╕└од╟днд┐д▒д╔═╜┴█д╔дкдъд╦╞░длд╩дд

racc д╦ -g еке╫е╖ечеєдЄд─д▒д╞е╤б╝е╡дЄ╜╨╬╧д╣дыд╚бве╟е╨е├е░═╤д╬е│б╝е╔дм
╔╒▓├д╡дьд▐д╣бгд│д│д╟бве╤б╝е╡епеще╣д╬едеєе╣е┐еєе╣╩╤┐Ї @yydebug дЄ true д╦
д╖д╞дкддд╞длдщ do_parse/yyparse дЄ╕╞д╓д╚бве╟е╨е├е░═╤есе├е╗б╝е╕дм╜╨╬╧
д╡дьд▐д╣бге╤б╝е╡дм╞░║юд╣ды══╗╥дм─╛└▄╕лдид▐д╣д╬д╟бв┤░┴┤д╦╕╜║▀д╬╛ї┬╓дЄ
╟─░од╟днд▐д╣бгд│дьдЄ╕лд╞д╔д│дмдкдлд╖ддд╬длдядлд├д┐дщдвд╚д╧─╛д╣д└д▒бг

== next_token д╦┤╪д╖д╞

ддд▐д└╝л╩мд╟дт╦║дьдыд│д╚дм┬┐ддд╬дм
б╓┴ўдые╚б╝епеєдм┐╘днд┐дщ [false,д╩д╦дл] дЄ┴ўдыб╫д╚ддджд│д╚д╟д╣бг
д┴д╩д▀д╦ Racc 0.10.2 ░╩╣▀д╟д╧░ь┼┘ [false,д╩д╦дл] дЄ╝їд▒╝шд├д┐дщ
д╜дь░╩╛х next_token д╧╕╞д╨д╩ддд│д╚дм╩▌╛┌д╡дьд╞ддд▐д╣бг

─╔╡нбз ║╟╢сд╧ [false,д╩д╦дл] д╟д╧д╩дп nil д╟дтдшддд│д╚д╦д╩д├д┐бг
e
= Debugging

== Racc reported syntax error.

Isn't there too many "end"?
grammar of racc file is changed in v0.10.

Racc does not use '%' mark, while yacc uses huge number of '%' marks..

== Racc reported "XXXX conflicts".

Try "racc -v xxxx.y".
It causes producing racc's internal log file, xxxx.output.

== Generated parsers does not work correctly

Try "racc -g xxxx.y".
This command let racc generate "debugging parser".
Then set @yydebug=true in your parser.
It produces a working log of your parser.
